{
  "backend/main.mo": "Motoko canister defining data types and initializing insights, solution features, range scenarios, and demo interactions.",
  "feature_evidence.json": "Feature evidence report mapping two animation-removal features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text mappings providing short predefined summaries for all frontend source files.",
  "frontend/index.css": "Tailwind-based global stylesheet defining light/dark OKLCH color tokens and base styling.",
  "frontend/index.html": "HTML entry point configuring metadata and loading the React app root and main script.",
  "frontend/src/App.tsx": "Main React app that initializes backend data and renders all top-level sections with theming and UI providers.",
  "frontend/src/components/AnimatedRoadHero.tsx": "Hero section with background image, headline, and navigation buttons for scrolling to demo and problem sections.",
  "frontend/src/components/animations/motionTokens.ts": "Defines shared animation timing, easing, and stagger values for motion effects.",
  "frontend/src/components/Footer.tsx": "Footer with branding, navigation links, social icons, and caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Sticky responsive header with navigation links and mobile menu toggle.",
  "frontend/src/components/UncertaintyBandChart.tsx": "Renders a horizontal uncertainty band visualization showing worst, predicted, best case, and trip distance markers. Computes percentage positions and displays them with styled gradients and labels.",
  "frontend/src/content/fallbackContent.ts": "Provides static fallback insight and solution feature data used when backend data is unavailable.",
  "frontend/src/hooks/useActor.ts": "Initializes and caches a backend actor based on Internet Identity, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context for Internet Identity, including login, logout, and persistence of identities.",
  "frontend/src/hooks/useQueries.ts": "Wraps actor calls in React Query hooks for fetching insights, features, range scenarios, stats, and recording interactions.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes with an EV-focused color palette.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/presentation/PresentationMode.tsx": "Implements slideshow-style presentation mode with navigation, slide rendering, and optional embedded charts.",
  "frontend/src/presentation/slides.ts": "Defines a Slide interface and a list of presentation slides covering the problem, insights, solution, impact, feasibility, and risks.",
  "frontend/src/sections/ImpactCostSection.tsx": "Renders expected impact metrics and a detailed cost breakdown with UI cards and icons.",
  "frontend/src/sections/InsightsSection.tsx": "Displays key insights from backend or fallback data using cards with titles, summaries, and implications.",
  "frontend/src/sections/ProblemSection.tsx": "Shows main EV range-anxiety pain points and outlines vehicle parameters and solution constraints.",
  "frontend/src/sections/RangeConfidenceDemoSection.tsx": "Interactive demo allowing users to adjust trip parameters and view calculated range confidence outputs.",
  "frontend/src/sections/SolutionSection.tsx": "Presents the three-module software solution using tabbed UI with feature descriptions and impacts.",
  "frontend/src/sections/WhatIfDefensibilitySection.tsx": "Renders a tabbed UI for what‑if defensibility scenarios, showing scenario details and results from applyScenario().",
  "frontend/src/utils/rangeModel.ts": "Computes EV range predictions, uncertainty, confidence scoring, and driving recommendations based on environmental and driving inputs.",
  "frontend/src/utils/scenarioEngine.ts": "Returns predefined scenario outcomes with confidence, range estimates, buffers, and recommended actions based on scenario ID.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theming, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes project goals, constraints, features, architectural notes, and overall state for the EV range‑anxiety prototype."
}